nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/sqi/processor/sqi_p32mz1024ecm064.h
PLIB_INLINE_API bool PLIB_SQI_ExistsRxBufferSoftReset(SQI_MODULE_ID index)
{
     return SQI_ExistsRxBufferSoftReset_Unsupported(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_TxBufferSoftReset(SQI_MODULE_ID index)
{
     SQI_TxBufferSoftReset_Unsupported(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsTxBufferSoftReset(SQI_MODULE_ID index)
{
     return SQI_ExistsTxBufferSoftReset_Unsupported(index);
}

PLIB_INLINE_API void PLIB_SQI_SoftReset(SQI_MODULE_ID index)
{
     SQI_SoftReset_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsSoftReset(SQI_MODULE_ID index)
{
     return SQI_ExistsSoftReset_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_BurstEnable(SQI_MODULE_ID index)
{
     SQI_BurstEnable_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsBurstControl(SQI_MODULE_ID index)
{
     return SQI_ExistsBurstControl_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_HoldSet(SQI_MODULE_ID index)
{
     SQI_HoldSet_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_HoldClear(SQI_MODULE_ID index)
{
     SQI_HoldClear_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_HoldGet(SQI_MODULE_ID index)
{
     return SQI_HoldGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsHoldPinControl(SQI_MODULE_ID index)
{
     return SQI_ExistsHoldPinControl_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_WriteProtectSet(SQI_MODULE_ID index)
{
     SQI_WriteProtectSet_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_WriteProtectClear(SQI_MODULE_ID index)
{
     SQI_WriteProtectClear_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_WriteProtectGet(SQI_MODULE_ID index)
{
     return SQI_WriteProtectGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsWPPinControl(SQI_MODULE_ID index)
{
     return SQI_ExistsWPPinControl_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_ReceiveLatchEnable(SQI_MODULE_ID index)
{
     SQI_ReceiveLatchEnable_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_ReceiveLatchDisable(SQI_MODULE_ID index)
{
     SQI_ReceiveLatchDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ReceiveLatchGet(SQI_MODULE_ID index)
{
     return SQI_ReceiveLatchGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsReceiveLatch(SQI_MODULE_ID index)
{
     return SQI_ExistsReceiveLatch_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_DataFormatSet(SQI_MODULE_ID index, SQI_DATA_FORMAT dataformat)
{
     SQI_DataFormatSet_Default(index, dataformat);
}

PLIB_INLINE_API SQI_DATA_FORMAT PLIB_SQI_DataFormatGet(SQI_MODULE_ID index)
{
     return SQI_DataFormatGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsDataFormat(SQI_MODULE_ID index)
{
     return SQI_ExistsDataFormat_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_DataModeSet(SQI_MODULE_ID index, SQI_DATA_MODE mode)
{
     SQI_DataModeSet_Default(index, mode);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsDataModeControl(SQI_MODULE_ID index)
{
     return SQI_ExistsDataModeControl_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_TransferModeSet(SQI_MODULE_ID index, SQI_XFER_MODE mode)
{
     SQI_TransferModeSet_Default(index, mode);
}

PLIB_INLINE_API SQI_XFER_MODE PLIB_SQI_TransferModeGet(SQI_MODULE_ID index)
{
     return SQI_TransferModeGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsTransferModeControl(SQI_MODULE_ID index)
{
     return SQI_ExistsTransferModeControl_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_ConfigWordSet(SQI_MODULE_ID index, bool sqiEnable, SQI_CS_OEN csPins, SQI_DATA_OEN dataPins, bool reset, bool burstEn, bool hold, bool writeProtect, bool rxLatch, SQI_DATA_FORMAT lsbf, SQI_DATA_MODE dataMode, SQI_XFER_MODE xferMode)
{
     SQI_ConfigWordSet_Default(index, sqiEnable, csPins, dataPins, reset, burstEn, hold, writeProtect, rxLatch, lsbf, dataMode, xferMode);
}

PLIB_INLINE_API uint32_t PLIB_SQI_ConfigWordGet(SQI_MODULE_ID index)
{
     return SQI_ConfigWordGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsConfigWord(SQI_MODULE_ID index)
{
     return SQI_ExistsConfigWord_Default(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_StatusCheckSet(SQI_MODULE_ID index, uint16_t statCheckCmd, uint8_t numStatBytes, SQI_LANE_MODE statCmdType, bool statBitPos)
{
     SQI_StatusCheckSet_Unsupported(index, statCheckCmd, numStatBytes, statCmdType, statBitPos);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsStatusCheck(SQI_MODULE_ID index)
{
     return SQI_ExistsStatusCheck_Unsupported(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_DDRModeSet(SQI_MODULE_ID index)
{
     SQI_DDRModeSet_Unsupported(index);
}

PLIB_INLINE_API bool _PLIB_UNSUPPORTED PLIB_SQI_DDRModeGet(SQI_MODULE_ID index)
{
     return SQI_DDRModeGet_Unsupported(index);
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_SQI_DDRModeClear(SQI_MODULE_ID index)
{
     SQI_DDRModeClear_Unsupported(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsDDRMode(SQI_MODULE_ID index)
{
     return SQI_ExistsDDRMode_Unsupported(index);
}

PLIB_INLINE_API void PLIB_SQI_ChipSelectDeassertEnable(SQI_MODULE_ID index)
{
     SQI_ChipSelectDeassertEnable_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_ChipSelectDeassertDisable(SQI_MODULE_ID index)
{
     SQI_ChipSelectDeassertDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsCSDeassert(SQI_MODULE_ID index)
{
     return SQI_ExistsCSDeassert_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_ChipSelectSet(SQI_MODULE_ID index, SQI_CS_NUM csNum)
{
     SQI_ChipSelectSet_Default(index, csNum);
}

PLIB_INLINE_API SQI_CS_NUM PLIB_SQI_ChipSelectGet(SQI_MODULE_ID index)
{
     return SQI_ChipSelectGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsChipSelect(SQI_MODULE_ID index)
{
     return SQI_ExistsChipSelect_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_LaneModeSet(SQI_MODULE_ID index, SQI_LANE_MODE mode)
{
     SQI_LaneModeSet_Default(index, mode);
}

PLIB_INLINE_API SQI_LANE_MODE PLIB_SQI_LaneModeGet(SQI_MODULE_ID index)
{
     return SQI_LaneModeGet_Default(index);
}

PLIB_INLINE_API bool PLIB_SQI_ExistsLaneMode(SQI_MODULE_ID index)
{
     return SQI_ExistsLaneMode_Default(index);
}

PLIB_INLINE_API void PLIB_SQI_TransferDirectionSet(SQI_MODULE_ID index, SQI_XFER_CMD command)
{
     SQI_TransferDirectionSet_Default(index, command);
}

PLIB_INLINE_API SQI_XFER_CMD PLIB_SQI_TransferDirectionGet(SQI_MODULE_ID index)
{
     return SQI_TransferDirectionGet_Default(index);
}

